app/controllers/contracts_controller.rb

SELECT * FROM "contracts"
---
 def index
   @contracts = Contract.all

SELECT * FROM "contracts" WHERE ("contracts"."id" = 5)
---
def show
  @contract = Contract.find(params[:id])

SELECT * FROM "contracts" WHERE ("contracts"."id" = 5)
---
def edit
 @contract = Contract.find(params[:id])

SELECT * FROM "contracts" WHERE ("contracts"."id" = 5)
UPDATE "contracts" SET "updated_at" = '2010-12-26 23:35:29', "medpolis" = 2313, "salary" = 240000, "birthday" = '1980-11-11 00:00:00', "pens" = 45454545, "inn" = 3535435, "passport" = 5454545, "education" = 'высшее' WHERE "id" = 5
---
def update
 @contract = Contract.find(params[:id])
 respond_to do |format|
 if @contract.update_attributes(params[:contract])

SELECT * FROM "contracts" WHERE ("contracts"."id" = 5)
DELETE FROM "contracts" WHERE "id" = 5
SELECT * FROM "teachers" WHERE (id = 5) LIMIT 1
DELETE FROM "teachers" WHERE "id" = 5
---
def destroy
  @contract = Contract.find(params[:id])
  @contract.destroy
  @teacher = Teacher.find(:first, :conditions => "id = #{@contract.teacher_id}")
  @teacher.destroy