app/controllers/disciplines_controller.rb

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
---
  def index
    @group = Group.find(params[:group_id])

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3 AND ("disciplines".group_id = 1))
---
  def show
    @group = Group.find(params[:group_id])
    @discipline = @group.disciplines.find(params[:id])

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
---
  def new
    @group = Group.find(params[:group_id])

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
INSERT INTO "disciplines" ("name", "cafedra_name", "created_at", "updated_at", "group_id", "cafedra_number") VALUES('Технологии разработки ПОдлд', 'Информационных систем и технологии', '2010-12-26 23:33:58', '2010-12-26 23:33:58', 1, 43)
---
  def create
    @group = Group.find(params[:group_id])
    @discipline = @group.disciplines.build(params[:discipline])

      if @discipline.save

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
DELETE FROM "disciplines" WHERE "id" = 3
---
  def destroy
    @group = Group.find(params[:group_id])
    @discipline = Discipline.find(params[:id])
    @discipline.destroy