app/controllers/disciplines_controller.rb

SELECT * FROM "disciplines" WHERE ("disciplines".group_id = 1)
---
  def index
    @disciplines = Discipline.all