app/controllers/group_controller.rb

 def index
   @groups = Group.all
---
SELECT * FROM "groups"

 def create
   @group = Group.new(params[:group])

   respond_to do |format|
     if @group.save
---
INSERT INTO "groups" ("created_at", "updated_at", "numb") VALUES('2010-12-13 23:54:57', '2010-12-13 23:54:57', '5361')

def show
  @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

def edit
 @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

def update
 @group = Group.find(params[:id])
 respond_to do |format|
 if @group.update_attributes(params[:group])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)
UPDATE "groups" SET "updated_at" = '2010-12-14 00:08:56', "numb" = '5362' WHERE "id" = 1

def destroy
  @group = Group.find(params[:id])
  @group.destroy
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)
DELETE FROM "groups" WHERE "id" = 1