app/controllers/groups_controller.rb

 def index
   @groups = Group.all
---
SELECT * FROM "groups"

 def create
   @group = Group.new(params[:group])

   respond_to do |format|
     if @group.save
---
INSERT INTO "groups" ("created_at", "updated_at", "numb") VALUES('2010-12-20 18:06:23', '2010-12-20 18:06:23', '5361')

def show
  @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

def edit
 @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 2)

def update
 @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 3)

def destroy
  @group = Group.find(params[:id])
  @group.destroy
---
SELECT * FROM "groups" WHERE ("groups"."id" = 2)
DELETE FROM "groups" WHERE "id" = 2