app/controllers/reportings_controller.rb

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
---
  def index
    @discipline = Discipline.find(params[:discipline_id])

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
SELECT * FROM "reportings" WHERE ("reportings"."id" = 3 AND ("reportings".discipline_id = 3))
---
  def show
    @discipline = Discipline.find(params[:discipline_id])
    @reporting = @discipline.reportings.find(params[:id])

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
---
  def new
    @discipline = Discipline.find(params[:discipline_id])

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
SELECT * FROM "reportings" WHERE ("reportings"."id" = 3 AND ("reportings".discipline_id = 3))
---
  def edit
    @discipline = Discipline.find(params[:discipline_id])
    @reporting = @discipline.reportings.find(params[:id])

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
INSERT INTO "reportings" ("created_at", "rtype", "updated_at", "group_id", "rktype", "discipline_id") VALUES('2010-12-26 23:34:07', 'Экзамен', '2010-12-26 23:34:07', NULL, '1', 3)
---
  def create
    @discipline = Discipline.find(params[:discipline_id])
    @reporting = @discipline.reportings.build(params[:reporting])

      if @reporting.save

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
SELECT * FROM "reportings" WHERE ("reportings"."id" = 3)
UPDATE "reportings" SET "updated_at" = '2010-12-26 23:34:46', "rktype" = '0' WHERE "id" = 3
---
  def update
    @discipline = Discipline.find(params[:discipline_id])
    @reporting = Reporting.find(params[:id])
     if @reporting.update_attributes(params[:reporting])