app/controllers/students_controller.rb

SELECT * FROM "groups" WHERE ("groups"."id" = 2)
---
  def index
    @group = Group.find(params[:group_id])

SELECT * FROM "groups" WHERE ("groups"."id" = 2)
SELECT * FROM "students" WHERE ("students"."id" = 1 AND ("students".group_id = 2))
---
  def show
    @group = Group.find(params[:group_id])
    @student = @group.students.find(params[:id])

SELECT * FROM "groups" WHERE ("groups"."id" = 2)
---
  def new
    @group = Group.find(params[:group_id])

SELECT * FROM "groups" WHERE ("groups"."id" = 2)
INSERT INTO "students" ("name", "created_at", "from", "updated_at", "bday", "lastname", "info", "group_id", "bmounth", "surname", "byear") VALUES('Антон', '2010-12-26 11:04:08', 'Москва', '2010-12-26 11:04:08', '5', 'Андреевич', '41236547', 1, '12', 'Сергеев', '1990')
---
  def create
    @group = Group.find(params[:group_id])
    @student = @group.students.build(params[:student])
    if @student.save

SELECT * FROM "groups" WHERE ("groups"."id" = 2)
SELECT * FROM "students" WHERE ("students"."id" = 1 AND ("students".group_id = 2))
---
   def edit
     @group = Group.find(params[:group_id])
     @student = @group.students.find(params[:id])

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
SELECT * FROM "students" WHERE ("students"."id" = 1)
UPDATE "students" SET "info" = '56887', "updated_at" = '2010-12-26 23:33:34', "bday" = '1', "bmounth" = '1' WHERE "id" = 5
---
   def update
     @group = Group.find(params[:group_id])
     @student = Student.find(params[:id])
     if @student.update_attributes(params[:student])

SELECT * FROM "groups" WHERE ("groups"."id" = 2)
SELECT * FROM "students" WHERE ("students"."id" = 1)
DELETE FROM "students" WHERE "id" = 1
---
   def destroy
     @group = Group.find(params[:group_id])
     @student = Student.find(params[:id])
     @student.destroy