app/controllers/student_controller.rb

SELECT * FROM "students" WHERE ("students"."id" = 13)
---
  def show
    @group = Group.find(params[:group_id])
    @student = @group.students.find(params[:id])

INSERT INTO "students" ("name", "group", "created_at", "updated_at", "info", "fac") VALUES(NULL, NULL, '2010-12-11 22:29:15', '2010-12-11 22:29:15', NULL, NULL)
---
  def create
    @group = Group.find(params[:group_id])
    @student = @group.students.build(params[:student])
    if @student.save

SELECT * FROM "students" WHERE ("students"."id" = 13)
---
   def edit
     @group = Group.find(params[:group_id])
     @student = @group.students.find(params[:id])

SELECT * FROM "students" WHERE ("students"."id" = 13)
UPDATE "students" SET "info" = 'хороший парень в целом', "updated_at" = '2010-12-14 00:30:12', "name" = 'Сергеев Антон Адреевич' WHERE "id" = 13
---
   def update
     @group = Group.find(params[:group_id])
     @student = Student.find(params[:id])
     if @student.update_attributes(params[:student])

SELECT * FROM "students" WHERE ("students"."id" = 14)
DELETE FROM "students" WHERE "id" = 14
---
   def destroy
     @group = Group.find(params[:group_id])
     @student = Student.find(params[:id])
     @student.destroy