app/controllers/teachers_controller.rb

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
---
  def index

    @discipline = Discipline.find(params[:discipline_id])

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
SELECT * FROM "teachers" WHERE ("teachers"."id" = 5 AND ("teachers".discipline_id = 3))
---
  def show
    @discipline = Discipline.find(params[:discipline_id])
    @teacher = @discipline.teachers.find(params[:id])

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
---
  def new
    @discipline = Discipline.find(params[:discipline_id])

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
SELECT * FROM "teachers" WHERE ("teachers"."id" = 5 AND ("teachers".discipline_id = 3))
---
  def edit
    @discipline = Discipline.find(params[:discipline_id])
    @teacher = @discipline.teachers.find(params[:id])

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
INSERT INTO "teachers" ("name", "cafedra_name", "created_at", "title", "updated_at", "lastname", "group_id", "stype", "kontrakt_id", "labtype", "surname", "cafedra_number", "ltype", "discipline_id") VALUES('Дмитрий', NULL, '2010-12-26 23:34:19', 'rthrth', '2010-12-26 23:34:19', 'Юрьевичd', NULL, '1', NULL, '1', 'ttryty', NULL, '1', 3)
INSERT INTO "contracts" ("name", "created_at", "medpolis", "updated_at", "lastname", "salary", "pens", "teacher_id", "birthday", "surname", "passport", "inn", "education") VALUES('Дмитрий', '2010-12-26 23:34:19', NULL, '2010-12-26 23:34:19', 'Юрьевичd', NULL, NULL, 5, NULL, 'ttryty', NULL, NULL, NULL)
---
  def create
    @discipline = Discipline.find(params[:discipline_id])
    @teacher = @discipline.teachers.build(params[:teacher])
      if @teacher.save
        @contract = Contract.create(:teacher_id => @teacher.id, :name => @teacher.name, :surname => @teacher.surname, :lastname => @teacher.lastname)

SELECT * FROM "disciplines" WHERE ("disciplines"."id" = 3)
SELECT * FROM "teachers" WHERE ("teachers"."id" = 5)
UPDATE "teachers" SET "lastname" = 'Юрьеви', "updated_at" = '2010-12-26 23:34:33' WHERE "id" = 5
---
  def update
    @discipline = Discipline.find(params[:discipline_id])
    @teacher = Teacher.find(params[:id])
     if @teacher.update_attributes(params[:teacher])